# ListNames Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportDWGSettings..::..ListNames Method
ExportDWGSettings Class See Also
---
Returns a list of names of dwg/dxf export settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static IList<string> ListNames(
	Document aDoc
)
```

Visual Basic
---
```text
Public Shared Function ListNames ( _
	aDoc As Document _
) As IList(Of String)
```

Visual C++
---
```text
public:
static IList<String^>^ ListNames(
	Document^ aDoc
)
```

# ### Parameters
aDoc
    Type: Autodesk.Revit.DB..::..Document A Revit document to retrieve names from.
# ### Return Value
An array of strings representing names of predefined setups.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportDWGSettings Class
Autodesk.Revit.DB Namespace